app/controllers/messages_controller.rb

SELECT "mymessages".* FROM "mymessages" WHERE "mymessages"."to" = ?  [["to", "vatsalshrivastav@yahoo.in"]]
---
	def index
		@messages = Mymessage.where(:to => current_user.email)

SELECT "mymessages".* FROM "mymessages"
---
	def show
		@messages = Mymessage.all