app/controllers/pings_controller.rb

SELECT "pings".* FROM "pings" WHERE "pings"."to" = ?  [["to", "vatsalshrivastav@yahoo.in"]]
---
	def index
		@pings = Ping.where(:to => current_user.email)

INSERT INTO "pings" ("to", "from", "message", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["to", "admin@g.com"], ["from", "user@g.com"], ["message", "Admin is cool"], ["created_at", "2018-02-07 22:46:36.103891"], ["updated_at", "2018-02-07 22:46:36.103891"]]
---
	def create
		@ping = Ping.new(ping_params)
		if @ping.save

SELECT  "pings".* FROM "pings" WHERE "pings"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
DELETE FROM "pings" WHERE "pings"."id" = ?  [["id", 6]]
---
	def destroy
		@ping = Ping.find(params[:id])
		@ping.destroy